Revit 2027 API
SpecTypeId.ColorTemperature Property
 Color Temperature, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ColorTemperature { get; }
Public Shared ReadOnly Property ColorTemperature As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ColorTemperature {
	ForgeTypeId^ get ();
}
static member ColorTemperature : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace